import {Charmap, Transliteration} from '../../transliterate.js';

export default {
  name: "Ulughees",
  category: "Taratai",
  font: "Geopoeia",
  charmap: new Charmap([
    "ă", "ä", "ã", "á", "Č", "č", "ð", "ĕ",
    "ë", "ẽ", "é", "ǝ", "ǧ", "ğ", "ĭ", "ï",
    "ĩ", "í", "ɩ", "k̊", "ł", "ŋ", "ñ", "ŏ",
    "ö", "õ", "ó", "p̊", "q̊", "ś", "š", "ş",
    "t̊", "Ç", "ç", "þ", "ŭ", "ü", "ũ", "ú",
    "ỹ", "ý", "ź", "ž", "ɂ"
  ]),
  transliteration: new Transliteration([
    // Punctuation
    [".", "\uE250"], [",", "\uE251"], ["!", "\uE252"], ["?", "\uE253"],
    [":", "\uE254"], ["{", "\uE257"], ["}", "\uE258"],

    // Numerals
    ["0","\uE25D"],  ["1","\uE25E"],  ["2","\uE25F"],  ["3","\uE260"],
    ["4","\uE261"],  ["5","\uE262"],  ["6","\uE263"],  ["7","\uE264"],
    ["8","\uE265"],  ["9","\uE266"],

    // Letters
    ["e", "\uE26B"], ["ĕ", "\uE26C"], ["ë", "\uE26D"], ["ẽ", "\uE26E"],
    ["é", "\uE26F"], ["p", "\uE271"], ["p̊", "\uE272"], ["b", "\uE273"],
    ["f", "\uE274"], ["v", "\uE275"], ["u", "\uE276"], ["ŭ", "\uE277"],
    ["ü", "\uE278"], ["ũ", "\uE279"], ["ú", "\uE27A"], ["w", "\uE27C"],
    ["m", "\uE27E"], ["t", "\uE27F"], ["t̊", "\uE280"], ["Ç", "\uE281"],
    ["d", "\uE282"], ["s", "\uE283"], ["ś", "\uE284"], ["š", "\uE285"],
    ["ş", "\uE286"], ["z", "\uE287"], ["ź", "\uE288"], ["ž", "\uE289"],
    ["a", "\uE28A"], ["ă", "\uE28B"], ["ä", "\uE28C"], ["ã", "\uE28D"],
    ["á", "\uE28E"], ["r", "\uE290"], ["l", "\uE292"], ["n", "\uE294"],
    ["ŋ", "\uE295"], ["ñ", "\uE296"], ["i", "\uE297"], ["ĭ", "\uE298"],
    ["ï", "\uE299"], ["ĩ", "\uE29A"], ["í", "\uE29B"], ["j", "\uE29D"],
    ["J", "\uE29E"], ["\\", "\uE29F"], ["Y", "\uE2A0"], ["C", "\uE2A1"],
    ["Č", "\uE2A2"], ["g", "\uE2A3"], ["G", "\uE2A4"], ["ǧ", "\uE2A5"],
    ["ğ", "\uE2A6"], ["o", "\uE2A7"], ["ŏ", "\uE2A8"], ["ö", "\uE2A9"],
    ["õ", "\uE2AA"], ["ó", "\uE2AB"], ["h", "\uE2AD"], ["'", "\uE2AF"],
    ["ɂ", "\uE2B0"], ["y", "\uE2B1"], ["ỹ", "\uE2B2"], ["ý", "\uE2B3"],
    ["k", "\uE2B5"], ["k̊", "\uE2B6"], ["q", "\uE2B7"], ["q̊", "\uE2B8"],
    ["þ", "\uE2B9"], ["ð", "\uE2BA"], ["x", "\uE2BB"], ["c", "\uE2BD"],
    ["ć", "\uE2BE"], ["č", "\uE2BF"], ["ç", "\uE2C0"], ["Q", "\uE2C1"],
    ["ǝ", "\uE2C2"], ["ɩ", "\uE2C3"], ["ł", "\uE2C5"]
  ], false, false)
};
